; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared4 - mode
	thermograph0 - mode
	image1 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	thermograph5 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 Planet13)
	(have_image Planet5 spectrograph2)
	(have_image Phenomenon6 infrared4)
	(have_image Phenomenon6 image1)
	(have_image Planet7 spectrograph2)
	(have_image Planet7 thermograph5)
	(have_image Star8 spectrograph2)
	(have_image Star8 image1)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon11 infrared4)
	(have_image Phenomenon11 image1)
	(have_image Planet12 spectrograph2)
	(have_image Planet13 thermograph5)
	(have_image Planet13 thermograph0)
	(have_image Star14 spectrograph3)
	(have_image Star14 thermograph5)
	(have_image Phenomenon15 spectrograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 19
2. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 19
3. (turn_to satellite1 planet7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet7)
   goals met: 0 of 19
4. (take_image satellite1 planet7 instrument3 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 1 of 19
5. (turn_to satellite1 planet13 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet13)
   goals met: 1 of 19
6. (take_image satellite1 planet13 instrument3 thermograph5)
   added: (have_image planet13 thermograph5)
   goals met: 2 of 19
7. (take_image satellite1 planet13 instrument3 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 3 of 19
8. (turn_to satellite1 phenomenon9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 19
9. (take_image satellite1 phenomenon9 instrument3 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 4 of 19
10. (take_image satellite1 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 5 of 19
11. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 19
12. (take_image satellite1 phenomenon10 instrument3 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 6 of 19
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 19
14. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 6 of 19
15. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 19
16. (take_image satellite0 phenomenon11 instrument0 infrared4)
   added: (have_image phenomenon11 infrared4)
   goals met: 7 of 19
17. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 7 of 19
18. (take_image satellite0 phenomenon6 instrument0 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 8 of 19
19. (turn_to satellite0 star14 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star14)
   goals met: 8 of 19
20. (take_image satellite0 star14 instrument0 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 9 of 19
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 9 of 19
22. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 9 of 19
23. (turn_to satellite0 star3 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star3)
   goals met: 9 of 19
24. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 9 of 19
25. (turn_to satellite0 phenomenon11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon11)
   goals met: 9 of 19
26. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 10 of 19
27. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 10 of 19
28. (take_image satellite0 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 11 of 19
29. (turn_to satellite0 star8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star8)
   goals met: 11 of 19
30. (take_image satellite0 star8 instrument1 image1)
   added: (have_image star8 image1)
   goals met: 12 of 19
31. (turn_to satellite0 planet13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet13)
   goals met: 13 of 19
32. (turn_to satellite1 star14 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star14)
   goals met: 13 of 19
33. (take_image satellite1 star14 instrument3 thermograph5)
   added: (have_image star14 thermograph5)
   goals met: 14 of 19
34. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 14 of 19
35. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 14 of 19
36. (turn_to satellite1 star3 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star3)
   goals met: 14 of 19
37. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 14 of 19
38. (turn_to satellite1 phenomenon15 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon15)
   goals met: 14 of 19
39. (take_image satellite1 phenomenon15 instrument2 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 15 of 19
40. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 15 of 19
41. (take_image satellite1 planet12 instrument2 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 16 of 19
42. (turn_to satellite1 planet5 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet5)
   goals met: 16 of 19
43. (take_image satellite1 planet5 instrument2 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 17 of 19
44. (turn_to satellite1 planet7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet7)
   goals met: 17 of 19
45. (take_image satellite1 planet7 instrument2 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 18 of 19
46. (turn_to satellite1 star8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star8)
   goals met: 18 of 19
47. (take_image satellite1 star8 instrument2 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 19 of 19
